duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_PMU_TEST/src/screen/screen.c
	}
#ifdef CONFIG_WIFI_SUPPORT	
	else if(screen_id == SCREEN_ID_WIFI_TEST)
	{
		MenuStartWifi();
	}
#endif	
#ifdef CONFIG_FOTA_DOWNLOAD	
	else if(screen_id == SCREEN_ID_FOTA)
	{
		MenuStartFOTA();
	}
#endif
#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
	else if(screen_id == SCREEN_ID_DL)
	{
		switch(g_dl_data_type)
		{
		case DL_DATA_IMG:
			switch(get_dl_status())
			{
			case DL_STATUS_PREPARE:
				dl_start();
				break;
				
			case DL_STATUS_FINISHED:
			case DL_STATUS_ERROR:
				if((strcmp(g_new_font_ver,g_font_ver) != 0) && (strlen(g_new_font_ver) > 0) && (strcmp(g_new_fw_ver, g_fw_version) == 0))
					dl_font_start();
			#if defined(CONFIG_PPG_SUPPORT)
				else if((strcmp(g_new_ppg_ver,g_ppg_algo_ver) != 0) && (strlen(g_new_ppg_ver) > 0))
					dl_ppg_start();
			#endif
				else
				{
					if(get_dl_status() == DL_STATUS_FINISHED)
						dl_reboot_confirm();
					else
						EntryIdleScr();
				}
				break;
			}
			break;

		case DL_DATA_FONT:
			switch(get_dl_status())
			{
			case DL_STATUS_PREPARE:
				dl_start();
				break;

			case DL_STATUS_FINISHED:
			case DL_STATUS_ERROR:
			#if defined(CONFIG_PPG_SUPPORT)
				if((strcmp(g_new_ppg_ver,g_ppg_algo_ver) != 0) && (strlen(g_new_ppg_ver) > 0))
					dl_ppg_start();
				else
			#endif		
				{
					if(get_dl_status() == DL_STATUS_FINISHED)
						dl_reboot_confirm();
					else
						EntryIdleScr();
				}
				break;
			}
			break;
			
		case DL_DATA_PPG:
			switch(get_dl_status())
			{
			case DL_STATUS_PREPARE:
				dl_start();
				break;

			case DL_STATUS_FINISHED:
			case DL_STATUS_ERROR:
				if(get_dl_status() == DL_STATUS_FINISHED)
					dl_reboot_confirm();
				else
					EntryIdleScr();
				break;
			}
			break;
		}
	}
#endif
#ifdef CONFIG_SYNC_SUPPORT
	else if(screen_id == SCREEN_ID_SYNC)
	{
		MenuStartSync();
	}
#endif
#ifdef CONFIG_TEMP_SUPPORT
	else if(screen_id == SCREEN_ID_TEMP)
	{
		if(get_temp_ok_flag)
		{
			EntryIdleScr();
		}
		else
		{
			MenuStartTemp();
		}
	}
#endif
	else if(screen_id == SCREEN_ID_SETTINGS)
	{
		ExitSettingsScreen();
	}
	else if(screen_id == SCREEN_ID_POWEROFF)
	{
		EntryIdleScr();
	}
#ifdef UI_STYLE_HEALTH_BAR
	else if(screen_id == SCREEN_ID_HR)
	{
	#ifdef CONFIG_PPG_SUPPORT
		if(get_hr_ok_flag)
		{
			EntryIdleScr();
		}
		else
		{
			MenuStartHr();
		}
	#endif
	}
	else if(screen_id == SCREEN_ID_SPO2)
	{
	#ifdef CONFIG_PPG_SUPPORT
		if(get_spo2_ok_flag)
		{
			EntryIdleScr();
		}
		else
		{
			MenuStartSpo2();
		}
	#endif
	}
	else if(screen_id == SCREEN_ID_BP)
	{
	#ifdef CONFIG_PPG_SUPPORT
		if(get_bpt_ok_flag)
		{
			EntryIdleScr();
		}
		else
		{
			MenuStartBpt();
		}
	#endif
	}
#endif/*UI_STYLE_HEALTH_BAR*/
}

#ifdef CONFIG_BLE_SUPPORT
void IdleShowBleStatus(void)
{
	uint16_t x,y,w,h;
	uint16_t ble_link_str[] = {0x0042,0x004C,0x0045,0x0000};//BLE

	LCD_SetFontSize(FONT_SIZE_28);

	if(g_ble_connected)
	{
		LCD_MeasureUniString(ble_link_str, &w, &h);
		LCD_ShowUniString(IDLE_BLE_X+(IDLE_BLE_W-w)/2, IDLE_BLE_Y+(IDLE_BLE_H-w)/2, ble_link_str);
	}
	else
	{
		LCD_FillColor(IDLE_BLE_X, IDLE_BLE_Y, IDLE_BLE_W, IDLE_BLE_H, BLACK);
	}
}
#endif

void IdleShowSystemDate(void)
{
	uint16_t x,y,w,h;
	uint8_t str_date[20] = {0};
	uint8_t tmpbuf[128] = {0};
#ifdef FONTMAKER_UNICODE_FONT	
	uint16_t str_mon[LANGUAGE_MAX][12][5] = {
										{
											{0x004A,0x0061,0x006E,0x0000,0x0000},//Jan
											{0x0046,0x0065,0x0062,0x0000,0x0000},//Feb
											{0x004D,0x0061,0x0072,0x0000,0x0000},//Mar
											{0x0041,0x0070,0x0072,0x0000,0x0000},//Apr
											{0x004D,0x0061,0x0079,0x0000,0x0000},//May
											{0x004A,0x0075,0x006E,0x0000,0x0000},//Jun
											{0x004A,0x0075,0x006C,0x0000,0x0000},//Jul
											{0x0041,0x0075,0x0067,0x0000,0x0000},//Aug
											{0x0053,0x0065,0x0070,0x0074,0x0000},//Sept
											{0x004F,0x0063,0x0074,0x0000,0x0000},//Oct
											{0x004E,0x006F,0x0076,0x0000,0x0000},//Nov
											{0x0044,0x0065,0x0063,0x0000,0x0000},//Dec
										},
										{
											{0x004A,0x0061,0x006E,0x0000,0x0000},//Jan
											{0x0046,0x0065,0x0062,0x0000,0x0000},//Feb
											{0x004D,0x00E4,0x0072,0x007A,0x0000},//M鋜z
											{0x0041,0x0070,0x0072,0x0000,0x0000},//Apr
											{0x004D,0x0061,0x0069,0x0000,0x0000},//Mai
											{0x004A,0x0075,0x006E,0x0000,0x0000},//Jun
											{0x004A,0x0075,0x006C,0x0000,0x0000},//Jul
											{0x0041,0x0075,0x0067,0x0000,0x0000},//Aug
											{0x0053,0x0065,0x0070,0x0074,0x0000},//Sept
											{0x004F,0x006B,0x0074,0x0000,0x0000},//Okt
											{0x004E,0x006F,0x0076,0x0000,0x0000},//Nov
											{0x0044,0x0065,0x007A,0x0000,0x0000},//Dez
										},
										{
											{0x4E00,0x6708,0x0000,0x0000,0x0000},//一月
											{0x4E8C,0x6708,0x0000,0x0000,0x0000},//二月
											{0x4E09,0x6708,0x0000,0x0000,0x0000},//三月
											{0x56DB,0x6708,0x0000,0x0000,0x0000},//四月
											{0x4E94,0x6708,0x0000,0x0000,0x0000},//五月
											{0x516D,0x6708,0x0000,0x0000,0x0000},//六月
											{0x4E03,0x6708,0x0000,0x0000,0x0000},//七月
											{0x516B,0x6708,0x0000,0x0000,0x0000},//八月
											{0x4E5D,0x6708,0x0000,0x0000,0x0000},//九月
											{0x5341,0x6708,0x0000,0x0000,0x0000},//十月
											{0x5341,0x4E00,0x6708,0x0000,0x0000},//十一月
											{0x5341,0x4E8C,0x6708,0x0000,0x0000},//十二月
										},
									};
	uint16_t str_mon_cn[2] = {0x6708,0x0000};
	uint16_t str_day_cn[2] = {0x65E5,0x0000};
#else	
	uint8_t *str_mon[12] = {"Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sept","Oct","Nov","Dec"};
#endif
	uint32_t img_24_num[10] = {IMG_FONT_24_NUM_0_ADDR,IMG_FONT_24_NUM_1_ADDR,IMG_FONT_24_NUM_2_ADDR,IMG_FONT_24_NUM_3_ADDR,IMG_FONT_24_NUM_4_ADDR,
							 IMG_FONT_24_NUM_5_ADDR,IMG_FONT_24_NUM_6_ADDR,IMG_FONT_24_NUM_7_ADDR,IMG_FONT_24_NUM_8_ADDR,IMG_FONT_24_NUM_9_ADDR};
	uint32_t img_20_num[10] = {IMG_FONT_20_NUM_0_ADDR,IMG_FONT_20_NUM_1_ADDR,IMG_FONT_20_NUM_2_ADDR,IMG_FONT_20_NUM_3_ADDR,IMG_FONT_20_NUM_4_ADDR,
							 IMG_FONT_20_NUM_5_ADDR,IMG_FONT_20_NUM_6_ADDR,IMG_FONT_20_NUM_7_ADDR,IMG_FONT_20_NUM_8_ADDR,IMG_FONT_20_NUM_9_ADDR};

	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);

	switch(global_settings.language)
	{
	case LANGUAGE_CHN:
		LCD_FillColor(IDLE_DATE_MON_CN_X, IDLE_DATE_MON_CN_Y, IDLE_DATE_MON_CN_W, IDLE_DATE_MON_CN_H, BLACK);

		x = IDLE_DATE_MON_CN_X;
		y = IDLE_DATE_MON_CN_Y;
		if(date_time.month > 9)
		{
			LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.month/10]);
			x += IDLE_DATE_NUM_CN_W;
		}
		LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.month%10]);
		x += IDLE_DATE_NUM_CN_W;
		LCD_ShowUniString(x, y, str_mon_cn);
		LCD_MeasureUniString(str_mon_cn, &w, &h);

